# install with
# brew bundle install

cask_args appdir: "/Applications"

tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"

brew "coreutils"
brew "ack"
brew "archey" # shows system info with apple logo
brew "autoconf"
brew "bash"
brew "bash-completion"
brew "git"
brew "grep"
brew "htop"
brew "oniguruma"
brew "jq"
brew "mtr"
brew "nmap"
brew "pv"
brew "tmux"
brew "tree"
brew "vim"

cask "atom"
cask "alfred"
cask "flux"
cask "spotify"
cask "vlc"
cask "google-chrome"
cask "firefox"
cask "iterm2"
cask "github"
cask "list"
