# install with
# brew bundle install

cask_args appdir: "/Applications"

tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"

################################
#  Commandline                 #
################################
brew "coreutils"
brew "archey" # shows system info with apple logo
brew "bash"
brew "bash-completion"
brew "git"
brew "grep"
brew "htop"
brew "oniguruma" # regex http://brewformulas.org/oniguruma
brew "jq"  # JSON formatter
brew "mas"  # commandline installation of appstore apps
brew "mtr"
brew "nmap"
brew "pv"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"

################################
#  Desktop Apps                #
################################
cask "atom"
cask "bitbar" # Put anything in your Mac OS X menu bar
cask "alfred"
cask "bartender" # organize your Mac OS X menu bar apps
cask "cafeine"
cask "dropbox"
cask "flux"   # it makes the color of your computer's display adapt to the time of day
cask "libreoffice"
cask "iconping" # check if online
cask "macdown" # markdown editor
cask "notational-velocity"
cask "spotify"
cask "vlc"
cask "google-chrome"
cask "firefox"
cask "iterm2"
cask "github-desktop"

################################
#  AppStore Apps               #
################################
mas "Slack", id: 803453959
