# install with
# brew bundle install

# create a Brewfile from the current enviroment
# brew bundle dump

cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/bundle"
#  Cask-Update tool that works with brew cask to update all of your Mac apps.
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"
################################
#  Commandline                 #
################################
brew "coreutils"
brew "bash"
brew "archey" # shows system info with apple logo
brew "bash"
brew "bash-completion"
brew "findutils" # Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "git"
brew "grep"
brew "htop"
brew "jq"  # JSON formatter
brew "mas"  # commandline installation of appstore apps
brew "mtr"
brew "nmap"
brew "netcat"
brew "python" # also adds pip
brew "pv"
brew "tmux"
brew "tldr"
brew "tree"
brew "vim"
brew "watch"
brew "heroku/brew/heroku"
brew "ncdu" # Show disk usage 
# ruby
brew "rbenv"
brew "ruby-build"
# docker 
brew "ctop" # https://github.com/bcicen/ctop
################################
#  Desktop Apps                #
################################
cask "visual-studio-code"
cask "bitbar" # Put anything in your Mac OS X menu bar
cask "alfred"
cask "bartender" # organize your Mac OS X menu bar apps
cask "caffeine"
cask "dropbox"
cask "flux"   # it makes the color of your computer's display adapt to the time of day
#cask "libreoffice"
cask "iconping" # check if online
cask "macdown" # markdown editor
cask "notational-velocity"
cask "spotify"
cask "vlc"
cask "google-chrome"
cask "firefox"
cask "iterm2"
cask "github"
cask "bitbar"
cask "firefox"
cask "font-fira-code"
cask "github"
cask "google-chrome"
cask "iterm2"
cask "sequel-pro" # mysql client gui
cask "skitch"
cask "spectacle" # Move and resize windows https://www.spectacleapp.com/
cask "tunnelblick" # VPN Tunnel

################################
#  AppStore Apps               #
################################
mas "Slack", id: 803453959

###############################
# python                      #
###############################

# pip "speedtest-cli"
