# install with
# brew bundle install

# create a Brewfile from the current enviroment
# brew bundle dump

cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/bundle"
tap "heroku/brew"
# Cask-Update tool that works with brew cask to update all of your Mac apps.
# brew cu
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"
################################
#  Commandline                 #
################################
brew "ffmpeg"
brew "hub"
brew "coreutils"
brew "bash"
brew "archey4" # shows system info with apple logo
brew "bash"
brew "bash-completion"
brew "findutils" # Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "git"
brew "grep"
brew "htop"
brew "jq"  # JSON formatter
brew "mas"  # commandline installation of appstore apps
brew "mtr"
brew "telnet"
brew "nmap"
brew "netcat"
brew "python" # also adds pip
brew "pv"
brew "tmux"
brew "tldr"
brew "tree"
brew "vim"
brew "watch"
brew "heroku/brew/heroku"
brew "ncdu" # Show disk usage
### development
# js runtime to compile rails assets
brew "nodejs"
# ruby
brew "rbenv"
brew "ruby-build"
# database libs
#brew "mysql"
brew "postgres"

# docker
brew "ctop" # https://github.com/bcicen/ctop
brew "speedtest-cli" # https://github.com/bcicen/ctop
brew "heroku/brew/heroku"
################################
#  Desktop Apps                #
################################
cask "visual-studio-code"
cask "bitbar" # Put anything in your Mac OS X menu bar
cask "alfred"
cask "bartender" # organize your Mac OS X menu bar apps
cask "caffeine"
cask "cyberduck"
cask "dropbox"
cask "flux"   # it makes the color of your computer's display adapt to the time of day
#cask "libreoffice"
cask "iconping" # check if online
cask "macdown" # markdown editor
cask "nvalt" # notational-velocity
cask "spotify"
cask "vlc"
cask "google-chrome"
cask "firefox"
cask "iterm2"
cask "github"
cask "bitbar"
cask "firefox"
cask "font-fira-code"
cask "github"
cask "google-chrome"
cask "iterm2"
cask "sequel-pro" # mysql client gui
cask "skitch"
cask "spectacle" # Move and resize windows https://www.spectacleapp.com/
cask "tunnelblick" # VPN Tunnel
cask "virtualbox" # VM's
cask "balenaetcher" # Flash OS images to SD cards & USB drives, safely and easily. https://www.balena.io/etcher/
cask "dbeaver-community" # SQL
################################
#  AppStore Apps               #
################################
mas "Slack", id: 803453959
mas "DaisyDisk", id: 411643860
mas "DevUtils", id: 1533756032
mas "Kindle", id: 405399194
mas "MindNode", id: 992076693
mas "New File Menu", id: 1064959555
mas "NordVPN IKE", id: 1116599239
mas "Pixelmator", id: 407963104
mas "Podcast Chapters", id: 1070963477
mas "Skitch", id: 425955336
mas "Slack", id: 8034539591
mas "Time Out", id: 402592703
mas "WhatsApp", id: 1147396723

###############################
# python                      #
###############################

# pip "speedtest-cli"
